In [2]:
import numpy as np
import pandas as pd

dict1={'Names':['Ramesh','Suresh','Sathish',np.nan],
       'Ages':[30,31,np.nan,32],
       'City':[np.nan,'Hyd','Pune','Chennai']}

d1=pd.DataFrame(dict1)
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [5]:
d1.fillna(method='pad',axis=0) # By defualt axis=0

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish  31.0     Pune
3  Sathish  32.0  Chennai